{
    "24": {
        "abilities": [
            "If someone deals you a damage with a red kill, that person can choose to either gain one health or draw a card"
        ],
        "name": "Hua Xiong"
    },
    "QUN026": {
        "abilities": [
            "If you use a black kill to deal a damage to someone, you can discard a card from their equipment field, if the card is horse, you can take it.",
            "Core effect: if your health is greater or equal to 3, you have -1. Otherwise, you have +1.",
            "Can only be gained from the effect above. Once per turn, you are able to select another character, observer all his cards in his hand and then select at most 1 heart card to put on top of deck or discard."
        ],
        "name": "Gong Sun Zan"
    },
    "QUN002": {
        "abilities": [
            "Core effect: your kills require 2 doges, dueling with you requires 2 kills",
            "If you deal damage to someone, that person has the choice to: let you take a card from that person, and that person chooses someone for you to duel with"
        ],
        "name": "Lü Bu"
    },
    "WEI003": {
        "abilities": [
            "If you get cards outside your turn, you can give it to others",
            "If you take damage, for each damage, you can choose to reveal a judgment card for the damage source, if red, they take 1 damage, if black, you can discard a card from them."
        ],
        "name": "Xia Hou Dun"
    },
    "WEI004": {
        "abilities": [
            "You can choose to draw x fewer cards to instead choose from x people who have greater or equal number of cards than you and draw one card from each of their hands."
        ],
        "name": "Zhang Liao"
    },
    "WEI005": {
        "abilities": [
            "Instead of drawing 2 cards, you could reveal top three cards of the deck, take all basics, weapons and duels. If you do so, on that turn, your kills and duels deal one extra damage."
        ],
        "name": "Xu Chu"
    },
    "WEI017": {
        "abilities": [
            "Instead of drawing, you can look at the top four cards, choose 2 and put the other 2 on the bottom in any order",
            "When you deal damage to others or when others deal damage to you, you can choose to let both of you guys draw a card from the deck."
        ],
        "name": "Li Dian"
    },
    "QUN003": {
        "abilities": [
            "At the end of your turn, you can draw a card.",
            "Once per turn, you can discard a card to let two male characters duel."
        ],
        "name": "Diao Chan"
    },
    "QUN001": {
        "abilities": [
            "On your turn, if you have cards, you can choose other people (at most 1 from each country, and cannot be in your country), you and each of these people discard a card. If any spade is discarded from this process, the owner of the spade draws a card.",
            "Outside your turn you can use any red card as peach."
        ],
        "name": "Hua Tuo"
    },
    "SHU001": {
        "abilities": [
            "You are able to give cards from your hand to others once per turn",
            "If you give out two or more cards in your turn, you get to play a basic card action without using any card"
        ],
        "name": "Liu Bei"
    },
    "SHU003": {
        "abilities": [
            "You are able to “kill” infinitely (use the kill card any number of times per turn). This is equivalent to having a free crossbow.",
            "ONCE PER GAME: gain health back to the amount you had before you ended your last turn, if you do so, you draw the number of cards equalling to the amount of health you gained"
        ],
        "name": "Zhang Fei"
    },
    "SHU004": {
        "abilities": [
            "At the beginning of your turn, you are able to look at the top min(x, 5) cards on the deck (where x is the number of players alive in the game). You are able to rearrange the order of these cards or put any number of these cards to the bottom of the deck",
            "When you have no cards in your hand, you cannot be selected as a target for duel or any type of “kill”"
        ],
        "name": "Zhu Ge Liang"
    },
    "SHU006": {
        "abilities": [
            "You have a -1 horse to start. This can be stacked once with the -1 horse card.",
            "If you select a person as an attacking target, you have the choice of using this ability:",
            "Check out the top card as a judgment.",
            "The target must discard a card with the same suit as the judgment card in order to dodge.",
            "The target loses all their non-core effects until the end of the turn."
        ],
        "name": "Ma Chao"
    },
    "SHU002": {
        "abilities": [
            "Once per turn, you are able to compare cards with another character, the winner being whoever puts the larger number (ace = 1, K = 13).",
            "If you lose the comparison (this includes ties), you have the choice of letting them gain one health.",
            "If you win the comparison, the loser cannot use any cards from their hand and lose all of their non-core effects until the end of the turn.",
            "Both players lose the card they used for the comparison",
            "All red cards (including equipped equipments) can be used as a normal “kill”"
        ],
        "name": "Guan Yu"
    },
    "SHU007": {
        "abilities": [
            "Each time you use a spell card, you are able to flip the top card as judgment, if that card is a basic card, you can take it, otherwise, you can only take it if you trade it with a card in your hand.",
            "Your spells are not limited by range. Your non-horse equipments cannot be discarded."
        ],
        "name": "Huang Yue Ying"
    },
    "SHU005": {
        "abilities": [
            "You are able to use any type of your kills as a dodge and your dodge as a normal kill",
            "If you use a card outside of your turn, you can flip a judgment card, if that card is of the same type as the card that you used, you are able to give to any player. If that card is not of the same type, you can put it back on top or discard it."
        ],
        "name": "Zhao Yun"
    },
    "WU001": {
        "abilities": [
            "Once per turn, you can discard any number of cards (including equipment) and draw that many cards from the deck",
            "If someone else from the same country revives you with a peach you gain 2 health"
        ],
        "name": "Sun Quan"
    },
    "SHU017": {
        "abilities": [
            "When another player ends their turn, if that player has dealt damage in that turn, you have a choice of using a kill to that player",
            "If you are injured and you deal damage to others, you must lose one health limit and gain the effect below",
            "This effect can only be gained permanently from the above effect. Once per turn, you are able to declare one of the three types (basic, spell, equipment) and keep flipping cards on top of the deck until a card of the declared type appears, then you are able to give this card to a male character in the game."
        ],
        "name": "Xu Shu"
    },
    "WU006": {
        "abilities": [
            "Once per turn, you are able to use one of the following:",
            "Use diamond as a skip turn and draw a card from the deck",
            "Use diamond to discard a skip turn and draw a card from the deck",
            "If you are selected as an attack target, you can discard a card to choose someone (who’s not the attacker) in your attack range and direct this attack to that person"
        ],
        "name": "Da Qiao"
    },
    "WU007": {
        "abilities": [
            "Whenever you are the only target of some spell used by someone else, you can choose to stack all of your cards in your hand on your character (you get them at the end of your turn).",
            "Whenever you run of cards in your hand, you can select up to x number of people to draw a card, where x is the number of cards you had right before you ran out of cards in your hand."
        ],
        "name": "Lu Xun"
    },
    "WU005": {
        "abilities": [
            "You draw an extra card, you can always hold the maximum number of cards that you can hold (equaling to your health limit)",
            "You can give a card from your hand to another character, that character must either reveal all cards in his hand and discard all cards of the same suit as the card that you give, from their hands+equipment field, or to decrease their health by 1."
        ],
        "name": "Zhou Yu"
    },
    "WU004": {
        "abilities": [
            "Once per turn, you can discard a card to decrease your health by 1 (not damage)",
            "If your health is decreased by 1 (without damage), then you draw 3 cards. On that turn, your red attacks are infinite range and undodgeable and you can use one extra attack."
        ],
        "name": "Huang Gai"
    },
    "WU003": {
        "abilities": [
            "If you do not use any type of “kill” in this turn, you can skip your discard phase. Using a duel card does not count as using a kill, but using a kill during a duel does count.",
            "TRANSFORM: At the beginning of your turn, if you have 3 or more cards in your hand than your health, then you lose one health limit and gain the effect below",
            "Can only be gained from the effect above. Once per turn, you are able to select another character, observer all his cards in his hand and then select at most 1 heart card to put on top of deck or discard."
        ],
        "name": "Lü Meng"
    },
    "WU002": {
        "abilities": [
            "All of your black cards can be used as discards",
            "ONCE PER GAME: you can unselect any number of targets for some card that is played that selects more than 1 target."
        ],
        "name": "Gan Ning"
    },
    "WEI007": {
        "abilities": [
            "Your black cards in your hand can be used as dodges",
            "At the start of your turn, you can keep revealing cards on top of the deck until you see a red card, you take all the black cards you revealed in this process."
        ],
        "name": "Zhen Ji"
    },
    "WEI001": {
        "abilities": [
            "If you take damage, you can either draw a card or take the card(if applicable) that dealt you the damage"
        ],
        "name": "Cao Cao"
    },
    "WEI002": {
        "abilities": [
            "When you take damage, for each damage, you can take a card from the damage source",
            "You can switch the result of a judgment by replacing it using a card of yours"
        ],
        "name": "Si Ma Yi"
    },
    "WEI006": {
        "abilities": [
            "Each damage you take, you can draw 2 cards, and then distribute up to cards to each player, if the player is not you, then they get the cards at the beginning of their turn.",
            "You take all of your judgment cards"
        ],
        "name": "Guo Jia"
    },
    "WEI012":{
        "name": "Dian Wei",
        "abilities": [
            "Once per turn, you can decrease your heath by one or discard a weapon card to deal one damage to another player within your range of attack."
        ]
    },
    "WU013":{
        "name": "Zhou Tai",
        "abilities": [
            "LOCKED. When your health becomes 0, you show the first card of the deck. If that card has different number than any other card that is placed on your character card, you put the card on your character card and heal your health back to 1. If not, discard that card. Whenever you have cards on your character card, your maximum hand card number equals to the number of cards on you character card.",
            "Whenever a player's hand card is discarded or taken by another player, you can decrease your health by 1 and let the person losing card draw two cards."
        ]
    },
    "SHU009":{
        "name":"Wei Yan",
        "abilities":[
            "For each damage you deal to players within one distance from you, you can heal by 1 or draw 1 card.",
            "ONCE PER GAME: during your main phase, you can decrease your health by X (you decide), then until the end of the turn, your distance to other players decrease by X, and you can use X+1 'kill's in total during that turn."
        ]
    },
    "SHU008":{
        "name:":"Huang Zhong",
        "abilities": [
            "You can use 'kill' on any player within <number on that kill card> distance to you. After you target your 'kill' on other players, if their number of hand cards is equal to or LESS than yours, that 'kill' cannot be dodged, also, if their health is equal to or GREATER than yours, the damage of the 'kill' += 1"
        ]
    },
    "WEI011":{
        "name":"Cao Ren",
        "abilities": [
            "At the end of your turn, you can draw a card and filp[1] your character card.",
            "Everytime your character card is flipped, you can draw a card, then you can use a spell or equipment card. If you used a card, you can discard a card of same kind on the field.",
            "*[1] FLIPPING character cards: at your start of your turn, if your character card is back side up, you flip it back and skip your ENTIRE turn."
        ]
    },
    "SHU013":{
        "name": "Liu Shan",
        "abilities": [
            "LOCKED. Whenever other players use 'kill' on you, they need to discard another basic card or that 'kill' has no effect.",
            "You can skip your main phase. If you do so, at the end of that turn, you can discard a hand card and let another player do one extra turn. (does not change the rotating order, tho)",
            "WHEN YOU ARE KING: TRANSFORM: at the beginning of your turn, if your health == min(all players' health), you increase your maximum health by 1, heal by 1, and gain the third ability below:",
            "WHEN YOU ARE KING: whenever you need to use or discard a 'kill', you can ask another red character to do it for you."
        ]
    }
}